testcase-stencil/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
	location		"system";
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     test-stencilFraction;

startFrom       startTime;

startTime       0.0;

stopAt          writeNow;

endTime         3;

// writeControl    timeStep;
// writeInterval   1;

writeControl    adjustableRunTime;
writeInterval   0.1;

deltaT          0.25;
//deltaT          1e-16;

purgeWrite      0;

writeFormat     ascii;

writePrecision  14;

writeCompression yes;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable no;

adjustTimeStep  yes;

maxCo           0.4;
maxAlphaCo      1.0;

maxDeltaT       0.005;


// ************************************************************************* //
