testcase-stencil/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type    zeroGradient;
    }

    bottom
    {
        type    zeroGradient;
    }

    left
    {
        type    zeroGradient;
        value   uniform 1;
    }

    right
    {
        type    zeroGradient;
    }

    front
    {
        type    empty;
    }
    back
    {
        type    empty;
    }
}

// ************************************************************************* //
